---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.ModifyingMultiGroups
source: html/956e49c1-7186-275e-378d-42581ae0ca31.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.ModifyingMultiGroups Property

Multiple groups of the same type are being edited simultaneously outside group edit mode in an unacceptable manner.

## Syntax (C#)
```csharp
public static FailureDefinitionId ModifyingMultiGroups { get; }
```